Revit 2027 API
FamilyInstancePlacingArgs.IsBanned Property
 Indicates if the cursor is banned or not.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsBanned { get; set; }
Public Property IsBanned As Boolean
	Get
	Set
public:
property bool IsBanned {
	bool get ();
	void set (bool value);
}
member IsBanned : bool with get, set
Property Value
Boolean
See Also
Reference
FamilyInstancePlacingArgs Class
Autodesk.Revit.UI Namespace